src/InformationRegisters/КлиентскиеТокеныСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентскиеТокеныСУЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиПолный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКриптохвост</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиМаркированнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Comment>Документ поступления</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСрокаГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыВводаВОборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыВводаВОборот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоВнеЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеПроизводствоРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеОтФизическихЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрансграничнаяТорговля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркировкаОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортФТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОтгрузкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОтгрузкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПричиныВыводаИзОборота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПричиныВыводаИзОборота</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РозничнаяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДистанционнаяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтратаПовреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уничтожение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конфискация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ликвидация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСобственныхНужд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КассовыйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварныйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможеннаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктУничтожения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыВозвратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыВозвратов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПриРозничнойРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПриДистанционномСпособе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекВозврата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДокументовСоответствия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументовСоответствия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СертификатСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияОСоответствии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СписаниеКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СписаниеКодовМаркировки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныСписанияКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныСписанияКодовМаркировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/ОбменССистемойМаркировкиВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Установить текущий номер сессии
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация, для которого получен ключ сессии
//  КлючСессии	 - Структура - Содержит ключ сессии и срок его использования
//
Процедура УстановитьТекущийНомерСессии(Организация, КлючСессии) Экспорт
	
	СоответствиеКлючей = Новый Соответствие(ПараметрыСеанса.НомерСессииМаркировки);
	СоответствиеКлючей.Вставить(Организация, КлючСессии);
	ПараметрыСеанса.НомерСессииМаркировки = Новый ФиксированноеСоответствие(СоответствиеКлючей);
	
КонецПроцедуры

// Получение ключа сессии организации
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации	 - Организация, для которой получаем ключ сессии.
// 
// Возвращаемое значение:
//  Структура - Ключ сессии и срок его актуальности.
//
Функция КлючСессииОрганизации(Организация) Экспорт
	
	НомераСессийМаркировки = ПараметрыСеанса.НомерСессииМаркировки;
	ТекущиеДанные = НомераСессийМаркировки.Получить(Организация);
	
	// Для текущей организации нет ключа сессии
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверим срок действия маркировки
	ДатаПроверки = ТекущаяДатаСеанса() - 90;
	Если ТекущиеДанные.СрокДействия < ДатаПроверки Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТекущиеДанные;
	
КонецФункции

// Получение ключа сессии организации для станции управления заказами (СУЗ)
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации	 - Организация, для которой получаем ключ сессии.
//  ИдентификаторСоединения - Строка - Идентификатор, для которого получаем токен.
// 
// Возвращаемое значение:
//  Структура - Ключ сессии и срок его актуальности.
//
Функция КлючСессииОрганизацииСУЗ(Организация, ИдентификаторСоединения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСоединения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.КлиентскиеТокеныСУЗ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.ИдентификаторСоединения.Установить(ИдентификаторСоединения);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПолучениеТокена = 90;
	Если НаборЗаписей[0].СрокДействия < УниверсальноеВремя(ТекущаяДатаСеанса() - ПолучениеТокена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущиеДанные = Новый Структура;
	ТекущиеДанные.Вставить("КлючСессии", НаборЗаписей[0].Токен);
	ТекущиеДанные.Вставить("СрокДействия", НаборЗаписей[0].СрокДействия);
	
	Возврат ТекущиеДанные;
	
КонецФункции

// Добавление записей в регистр состояния кодов маркировки
//
// Параметры:
//  Документ - ДокументСсылка - Документ, на основании которого добавление в регистр
//  Товары - ТаблицаЗначений - Список товаров документа
//  МассивКодовМаркировки - Массив - Массив списка кодов маркировки
//  Состояние - ПеречислениеСсылка.СостоянияКодовМаркировки - Состояние установки
//  ОписаниеОшибки - Строка - Текст ошибки
//  ДляПечати - Булево - Признак того, что код маркировки нужен для печати
//
Процедура ЗаписатьКодыМаркировкиВРегистр(
		Документ,
		Товары,
		МассивКодовМаркировки,
		Состояние,
		ОписаниеОшибки,
		ДляПечати = Ложь) Экспорт
	
	Если Товары = Неопределено Тогда
		ТоварыДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Товары").Выгрузить();
	Иначе
		ТоварыДокумента = Товары;
	КонецЕсли;
	
	РегистрыСведений.СостоянияКодовМаркировки.ДобавитьЗаписиВРегистр(
		Документ, ТоварыДокумента, МассивКодовМаркировки, Состояние, ОписаниеОшибки, ДляПечати);
	
КонецПроцедуры

#Область ОбменЧерезAPI

// Формирует запрос JSON для передачи документа в Честный знак и при необходимости выводит данные для подписи
//
// Параметры:
//  УникальныйИдентификатор	- УникальныйИдентификатор	- Уникальный идентификатор.
//  ДополнительныеПараметры	- Структура					- Набор параметров, использующихся при выполнения операции.
// 
// Возвращаемое значение:
//  Структура              - параметры выполнения задания: 
//   * Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                     "Выполнено", если задание было успешно выполнено;
//                                     "Ошибка", если задание завершено с ошибкой;
//                                     "Отменено", если задание отменено пользователем или администратором.
//   * ИдентификаторЗадания - УникальныйИдентификатор - если Статус = "Выполняется", то содержит 
//                                     идентификатор запущенного фонового задания.
//   * АдресРезультата       - Строка - адрес временного хранилища, в которое будет
//                                     помещен (или уже помещен) результат работы процедуры.
//   * АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//                                     содержит адрес дополнительного временного хранилища,
//                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//
Функция ФормированиеЗапросаВФоне(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование запроса в Честный знак'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.СформироватьЗапрос",
		ДополнительныеПараметры,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции // ФормированиеЗапросаВФоне()

// Формирует запрос JSON для передачи документа в Честный знак и при необходимости выводит данные для подписи
//
// Параметры:
//  УникальныйИдентификатор	- УникальныйИдентификатор	- Уникальный идентификатор.
//  ДополнительныеПараметры	- Структура					- Набор параметров, использующихся при выполнения операции.
// 
// Возвращаемое значение:
//  Структура              - параметры выполнения задания: 
//   * Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                     "Выполнено", если задание было успешно выполнено;
//                                     "Ошибка", если задание завершено с ошибкой;
//                                     "Отменено", если задание отменено пользователем или администратором.
//   * ИдентификаторЗадания - УникальныйИдентификатор - если Статус = "Выполняется", то содержит 
//                                     идентификатор запущенного фонового задания.
//   * АдресРезультата       - Строка - адрес временного хранилища, в которое будет
//                                     помещен (или уже помещен) результат работы процедуры.
//   * АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//                                     содержит адрес дополнительного временного хранилища,
//                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//
Функция ОтправитьЗапросВФоне(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка запроса в Честный знак'");
	
	Если ДополнительныеПараметры.Свойство("КлючСессии") И НЕ ЗначениеЗаполнено(ДополнительныеПараметры.КлючСессии) Тогда
		Если ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "КлючСессииСУЗ", Ложь) Тогда
			КлючСессии = КлючСессииОрганизацииСУЗ(
				ДополнительныеПараметры.Организация,
				ДополнительныеПараметры.ИдентификаторСоединения);
		Иначе
			КлючСессии = КлючСессииОрганизации(ДополнительныеПараметры.Организация);
		КонецЕсли;
		Если ЗначениеЗаполнено(КлючСессии) Тогда
			ДополнительныеПараметры.КлючСессии = КлючСессии.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.ОтправитьЗапрос",
		ДополнительныеПараметры,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции // ФормированиеЗапросаВФоне()

// Формирует запрос для получения данных по коду товаров для маркируемых остатков
//
// Параметры:
//  УникальныйИдентификатор	- УникальныйИдентификатор	- Уникальный идентификатор.
//  ДополнительныеПараметры	- Структура					- Набор параметров, использующихся при выполнения операции.
// 
// Возвращаемое значение:
//  Структура              - параметры выполнения задания: 
//   * Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                     "Выполнено", если задание было успешно выполнено;
//                                     "Ошибка", если задание завершено с ошибкой;
//                                     "Отменено", если задание отменено пользователем или администратором.
//   * ИдентификаторЗадания - УникальныйИдентификатор - если Статус = "Выполняется", то содержит 
//                                     идентификатор запущенного фонового задания.
//   * АдресРезультата       - Строка - адрес временного хранилища, в которое будет
//                                     помещен (или уже помещен) результат работы процедуры.
//   * АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//                                     содержит адрес дополнительного временного хранилища,
//                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//
Функция ПроверитьКлючСессии(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка запроса в Честный знак'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.ПроверитьКлючСессии",
		ДополнительныеПараметры,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции // КодыТоваровОстатков()

// Формирует запрос для получения данных по коду товаров для маркируемых остатков
//
// Параметры:
//  УникальныйИдентификатор	- УникальныйИдентификатор	- Уникальный идентификатор.
//  ДополнительныеПараметры	- Структура					- Набор параметров, использующихся при выполнения операции.
// 
// Возвращаемое значение:
//  Структура              - параметры выполнения задания: 
//   * Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                     "Выполнено", если задание было успешно выполнено;
//                                     "Ошибка", если задание завершено с ошибкой;
//                                     "Отменено", если задание отменено пользователем или администратором.
//   * ИдентификаторЗадания - УникальныйИдентификатор - если Статус = "Выполняется", то содержит 
//                                     идентификатор запущенного фонового задания.
//   * АдресРезультата       - Строка - адрес временного хранилища, в которое будет
//                                     помещен (или уже помещен) результат работы процедуры.
//   * АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//                                     содержит адрес дополнительного временного хранилища,
//                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//
Функция КодыТоваровОстатков(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка запроса в Честный знак'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.ПолучениеКодыТоваровОстатков",
		ДополнительныеПараметры,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции // КодыТоваровОстатков()

// Формирует запрос для получения кодов маркировки по Заказу на эмиссию кодов
//
// Параметры:
//  УникальныйИдентификатор	- УникальныйИдентификатор	- Уникальный идентификатор.
//  ДополнительныеПараметры	- Структура					- Набор параметров, использующихся при выполнения операции.
// 
// Возвращаемое значение:
//  Структура              - параметры выполнения задания: 
//   * Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                     "Выполнено", если задание было успешно выполнено;
//                                     "Ошибка", если задание завершено с ошибкой;
//                                     "Отменено", если задание отменено пользователем или администратором.
//   * ИдентификаторЗадания - УникальныйИдентификатор - если Статус = "Выполняется", то содержит 
//                                     идентификатор запущенного фонового задания.
//   * АдресРезультата       - Строка - адрес временного хранилища, в которое будет
//                                     помещен (или уже помещен) результат работы процедуры.
//   * АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//                                     содержит адрес дополнительного временного хранилища,
//                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//
Функция ЗапросЗагрузкиКодовМаркировки(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение кодов маркировки'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.ЗапросЗагрузкиКодовМаркировки",
		ДополнительныеПараметры,
		ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции // ФормированиеЗапросаВФоне()

// Формирует запрос для получения актуальных статусов кодов маркировки
//
// Параметры:
//  УникальныйИдентификатор	- УникальныйИдентификатор	- Уникальный идентификатор.
//  ДополнительныеПараметры	- Структура					- Набор параметров, использующихся при выполнения операции.
// 
// Возвращаемое значение:
//  Структура              - параметры выполнения задания: 
//   * Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                     "Выполнено", если задание было успешно выполнено;
//                                     "Ошибка", если задание завершено с ошибкой;
//                                     "Отменено", если задание отменено пользователем или администратором.
//   * ИдентификаторЗадания - УникальныйИдентификатор - если Статус = "Выполняется", то содержит 
//                                     идентификатор запущенного фонового задания.
//   * АдресРезультата       - Строка - адрес временного хранилища, в которое будет
//                                     помещен (или уже помещен) результат работы процедуры.
//   * АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//                                     содержит адрес дополнительного временного хранилища,
//                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//
Функция ЗапросСтатусовКодовМаркировки(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение статусов кодов маркировки'");
	
	Если ДополнительныеПараметры.Свойство("КлючСессии") И НЕ ЗначениеЗаполнено(ДополнительныеПараметры.КлючСессии) Тогда
		КлючСессии = КлючСессииОрганизации(ДополнительныеПараметры.Организация);
		Если ЗначениеЗаполнено(КлючСессии) Тогда
			ДополнительныеПараметры.КлючСессии = КлючСессии.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.ЗапросСтатусовКодовМаркировки",
		ДополнительныеПараметры,
		ПараметрыВыполнения
	);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Формирует запрос для получения актуальных статусов кодов маркировки
//
// Параметры:
//  УникальныйИдентификатор	- УникальныйИдентификатор	- Уникальный идентификатор.
//  ДополнительныеПараметры	- Структура					- Набор параметров, использующихся при выполнения операции.
// 
// Возвращаемое значение:
//  Структура              - параметры выполнения задания: 
//   * Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                     "Выполнено", если задание было успешно выполнено;
//                                     "Ошибка", если задание завершено с ошибкой;
//                                     "Отменено", если задание отменено пользователем или администратором.
//   * ИдентификаторЗадания - УникальныйИдентификатор - если Статус = "Выполняется", то содержит 
//                                     идентификатор запущенного фонового задания.
//   * АдресРезультата       - Строка - адрес временного хранилища, в которое будет
//                                     помещен (или уже помещен) результат работы процедуры.
//   * АдресДополнительногоРезультата - Строка - если установлен параметр ДополнительныйРезультат, 
//                                     содержит адрес дополнительного временного хранилища,
//                                     в которое будет помещен (или уже помещен) результат работы процедуры.
//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//
Функция ЗапросСверкиКодовМаркировки(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение кодов маркировки'");
	
	Если ДополнительныеПараметры.Свойство("КлючСессии") И НЕ ЗначениеЗаполнено(ДополнительныеПараметры.КлючСессии) Тогда
		КлючСессии = КлючСессииОрганизации(ДополнительныеПараметры.Организация);
		Если ЗначениеЗаполнено(КлючСессии) Тогда
			ДополнительныеПараметры.КлючСессии = КлючСессии.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.ЗапросСверкиКодовМаркировки",
		ДополнительныеПараметры,
		ПараметрыВыполнения
	);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Функция ЗапросВложенныхКодовМаркировки(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение вложенных кодов маркировки'");
	
	Если ДополнительныеПараметры.Свойство("КлючСессии") И НЕ ЗначениеЗаполнено(ДополнительныеПараметры.КлючСессии) Тогда
		КлючСессии = КлючСессииОрганизации(ДополнительныеПараметры.Организация);
		Если ЗначениеЗаполнено(КлючСессии) Тогда
			ДополнительныеПараметры.КлючСессии = КлючСессии.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.ЗапросВложенныхКодовМаркировки",
		ДополнительныеПараметры,
		ПараметрыВыполнения
	);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Функция ЗапросНаПолучениеКодовМаркировкиОрганизации(УникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение кодов маркировки организации'");
	
	Если ДополнительныеПараметры.Свойство("КлючСессии") И НЕ ЗначениеЗаполнено(ДополнительныеПараметры.КлючСессии) Тогда
		КлючСессии = КлючСессииОрганизации(ДополнительныеПараметры.Организация);
		Если ЗначениеЗаполнено(КлючСессии) Тогда
			ДополнительныеПараметры.КлючСессии = КлючСессии.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбменССистемойМаркировкиСервер.ЗапросНаПолучениеКодовМаркировкиОрганизации",
		ДополнительныеПараметры,
		ПараметрыВыполнения
	);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#Область ОбменЧерезФайл

// Получение данных запроса заказа кодов маркировки в файл
//
// Параметры:
//  Документ - ДокументСсылка.ЗаказКодовМаркировки - Документ, для которого выполняется запрос
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ЗапросНаПолучениеКодовМаркировки(Документ) Экспорт
	
	ДанныеДокумента = Документы.ЗаказКодовМаркировки.ДанныеЗапросаЗаказаКодов(Документ);
	
	ВидПродукции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ОсобенностьУчета.ТоварнаяГруппа");
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("order");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("xmlns", "urn:oms.order");
	ЗаписьXML.ЗаписатьАтрибут("xsi:schemaLocation", "urn:oms.order order-v5.5.xsd");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ВидПродукции);
	
	ЗаписьТекстаВФайл(ЗаписьXML, "productGroupe", ВидПродукции);
	
	Для Каждого ТекущийЭлемент Из ДанныеДокумента Цикл
		
		Если ТекущийЭлемент.Ключ = "products" Тогда
			Продолжить;
		Иначе
			ЗаписьТекстаВФайл(ЗаписьXML, ТекущийЭлемент.Ключ, ТекущийЭлемент.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("products");
	
	Для Каждого ТекущаяСтрока Из ДанныеДокумента.products Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("product");
		
		Для Каждого СтрокаТовара Из ТекущаяСтрока Цикл
			
			Если СтрокаТовара.Ключ = "serialNumbers" Тогда
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("serialNumbers");
				
				Для Каждого ТекущийНомер Из СтрокаТовара.Значение Цикл
					ЗаписьТекстаВФайл(ЗаписьXML, "serialNumber", ТекущийНомер);
				КонецЦикла;
				
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
			Иначе
				ЗаписьТекстаВФайл(ЗаписьXML, СтрокаТовара.Ключ, СтрокаТовара.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ТекстЗапроса = ЗаписьXML.Закрыть();
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстЗапроса);
	
	Возврат ТекстовыйДокумент;
	
КонецФункции // ЗапросаНаПолучениеКодовМаркировки()

// Получение данных запроса заказа генерации GTIN в файл
//
// Параметры:
//  Документ - ДокументСсылка.ЗаказКодовМаркировки - Документ, для которого выполняется запрос
//  ТекстОшибки - Строка - Текст ошибки при запросе
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ЗапросаНаОписаниеОстатковНоменклатуры(Документ, ТекстОшибки = "") Экспорт
	
	ДанныеДокумента = Документы.ЗаказКодовМаркировки.ОписаниеОстатков(Документ, ТекстОшибки);
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ТекстовыйФайл.ДобавитьСтроку("ИНН участника оборота,Версия");
	ТекстовыйФайл.ДобавитьСтроку(СтрШаблон("%1,%2", СокрЛП(ДанныеДокумента.trade_participant_inn), "2"));
	ТекстовыйФайл.ДобавитьСтроку("Список товаров,,,,,,");
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(НСтр("ru = 'Код товарной номенклатуры (2 знака), Торговая Марка Бренд,'"));
	МассивСтрок.Добавить(НСтр("ru = 'Наименование товара, Целевой пол, Способ ввода товара в оборот,'"));
	МассивСтрок.Добавить(НСтр("ru = 'Возраст потребителя, Модель/артикул производителя'"));
	
	ТекстовыйФайл.ДобавитьСтроку(СтрСоединить(МассивСтрок, " "));
	
	Для Каждого ТекущаяСтрока Из ДанныеДокумента.products_list Цикл
		
		Модель = ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "model", "");
		СпособВыпускаВОборот =
			СпособВыпускаВОборот(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "release_method", ""));
		ВозрастнаяКатегория = 
			ВозрастнаяКатегория(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "consumer_age", ""));
		ЦелевойПол = ЦелевойПол(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "product_gender", ""));
		
		ТекстовыйФайл.ДобавитьСтроку(
			СтрШаблон("%1,%2,,%3,%4,%5,%6",
				ТекущаяСтрока.tnved_code_2,
				ТекущаяСтрока.brand,
				ЦелевойПол,
				СпособВыпускаВОборот,
				ВозрастнаяКатегория,
				Модель));
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(
		СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	
	Возврат ТекстовыйФайл;
	
КонецФункции

// Получение данных запроса ввода кодов маркировки в файл
//
// Параметры:
//  Документ - ДокументСсылка.ВводВОборотКодовМаркировки - Документ, для которого выполняется запрос
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ЗапросВводаВОборотКодовМаркировки(Документ) Экспорт
	
	ДанныеДокумента = Документы.ВводВОборотКодовМаркировки.ДанныеВводаВОборотКодовМаркировки(Документ);
	
	СпособВводаМаркировки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "СпособВводаВОборот");
	
	Если СпособВводаМаркировки = Перечисления.СпособыВводаВОборот.МаркировкаОстатков Тогда
		Возврат ЗапросВводаВОборотМаркировкиОстатки(ДанныеДокумента);
	КонецЕсли;
	
КонецФункции // ЗапросВводаВОборотКодовМаркировки()

// Получение данных запроса вывода из оборота кодов маркировки в файл
//
// Параметры:
//  Документ	 - ДокументСсылка.ВводВОборотКодовМаркировки - Документ, для которого выполняется запрос
//  ТекстОшибки	 - Строка									 - Содержит текст ошибки при проверки документа
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ЗапросВыводаИзОборотаКодовМаркировки(Документ, ТекстОшибки = "") Экспорт
	
	ДанныеДокумента = Документы.ВыводИзОборотаКодовМаркировки.ДанныеВыводаИзОборотаКодовМаркировки(Документ);
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ТекстовыйФайл.ДобавитьСтроку(
		НСтр("ru = 'ИНН участника оборота,Причина вывода из оборота,Дата вывода из оборота,Тип первичного документа,"
		+ "Номер первичного документа,Дата первичного документа,Наименование первичного документа,"
		+ "Регистрационный номер ККТ,Версия'"));
	ТекстовыйФайл.ДобавитьСтроку(
		СтрШаблон("%1,%2,%3,%4,%5,%6,%7,%8,%9",
			ДанныеДокумента.inn,
			ПричинаВыводаИзОборота(ДанныеДокумента.action),
			ДанныеДокумента.action_date,
			ВидПервичногоДокумента(ДанныеДокумента.document_type),
			ДанныеДокумента.document_number,
			ДанныеДокумента.document_date,
			ПолучитьЗначениеПараметраСтруктуры(ДанныеДокумента, "primary_document_custom_name", ""),
			"",
			"4"));
	
	ТекстовыйФайл.ДобавитьСтроку("Параметры товаров,,,,,");
	ТекстовыйФайл.ДобавитьСтроку(НСтр("ru = 'КИ,Цена за единицу,Тип первичного документа,Номер первичного документа,"
		+ "Дата первичного документа,Наименование первичного документа'"));
	
	Для Каждого ТекущаяСтрока Из ДанныеДокумента.products Цикл
		
		ВидПервичногоДокумента = "";
		НомерПервичногоДокумента = "";
		ДатаПервичногоДокумента = "";
		НаименованиеПервичногоДокумента = "";
		Если ТекущаяСтрока.Свойство("primary_document_type") Тогда
			ВидПервичногоДокумента = ВидПервичногоДокумента(ТекущаяСтрока.primary_document_type);
			НомерПервичногоДокумента = ТекущаяСтрока.primary_document_number;
			ДатаПервичногоДокумента = ТекущаяСтрока.primary_document_date;
			Если ТекущаяСтрока.Свойство("primary_document_custom_name") Тогда
				НаименованиеПервичногоДокумента = ТекущаяСтрока.primary_document_custom_name;
			КонецЕсли;
		КонецЕсли;
		
		ТекстовыйФайл.ДобавитьСтроку(
			СтрШаблон(
				"%1,%2,%3,%4,%5,%6",
				"""" + СтрЗаменить(ТекущаяСтрока.cis, """", """""") + """",
				ТекущаяСтрока.product_cost,
				ВидПервичногоДокумента,
				НомерПервичногоДокумента,
				ДатаПервичногоДокумента,
				НаименованиеПервичногоДокумента));
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	
	Возврат ТекстовыйФайл;
	
КонецФункции

// Получение данных запроса перемаркировки в файл
//
// Параметры:
//  Документ - ДокументСсылка.ВводВОборотКодовМаркировки - Документ, для которого выполняется запрос
//  ТекстОшибки	 - Строка								 - Содержит текст ошибки при проверки документа
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ЗапросПеремаркировкиТовара(Документ, ТекстОшибки = "") Экспорт
	
	ДанныеДокумента = Документы.Перемаркировка.ДанныеПеремаркировкиКодов(Документ, ТекстОшибки);
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ТекстовыйФайл.ДобавитьСтроку(НСтр("ru = 'ИНН участника оборота,Дата перемаркировки,Причина перемаркировки,Версия'"));
	ТекстовыйФайл.ДобавитьСтроку(
		СтрШаблон("%1,%2,%3,%4",
			СокрЛП(ДанныеДокумента.participant_inn),
			ДанныеДокумента.remarking_date,
			ДанныеДокумента.remarking_cause,
			"5"));
	ТекстовыйФайл.ДобавитьСтроку("Параметры товаров,,,,,,,,,,,");
	ТекстовыйФайл.ДобавитьСтроку(
		НСтр("ru = 'Предыдущий КИ,Новый КИ,Код товарной номерклатуры,Дата перемаркировки,Товар оплачен,Тип первичного документа,"
		+ "Наименование первичного документа,Номер первичного документа,Дата первичного документа,"
		+ """Вид документа, подтверждающего соответствие"",""Номер документа, подтверждающего соответствие"","
		+ """Дата документа, подтверждающего соответствие"", Страна производства, Цвет, Размер'"));
		
	Для Каждого ТекущаяСтрока Из ДанныеДокумента.products Цикл
		
		КИ = ?(ТекущаяСтрока.Свойство("last_uin"), """" + СтрЗаменить(ТекущаяСтрока.last_uin, """", """""") + """", "");
		КИНовый = """" + СтрЗаменить(ТекущаяСтрока.new_uin, """", """""") + """";
		
		СтрокаКМ = Новый Массив;
		СтрокаКМ.Добавить(КИ);
		СтрокаКМ.Добавить(КИНовый);
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "tnved_10", ""));
		СтрокаКМ.Добавить(ТекущаяСтрока.remarking_date);
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "paid", ""));
		
		ВидДокумента = "";
		Если ТекущаяСтрока.Свойство("primary_document_type") Тогда
			ВидДокумента = ВидПервичногоДокумента(ТекущаяСтрока.primary_document_type);
		КонецЕсли;
		
		СтрокаКМ.Добавить(ВидДокумента);
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "primary_document_custom_name", ""));
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "primary_document_number", ""));
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "primary_document_date", ""));
		
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "certificate_type", ""));
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "certificate_number", ""));
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "certificate_date", ""));
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "production_country", ""));
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "color", ""));
		СтрокаКМ.Добавить(ПолучитьЗначениеПараметраСтруктуры(ТекущаяСтрока, "product_size", ""));
		
		ТекстовыйФайл.ДобавитьСтроку(СтрСоединить(СтрокаКМ, ","));
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(
		СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	
	Возврат ТекстовыйФайл;
	
КонецФункции

// Получение данных запроса списания кодов маркировки в файл
//
// Параметры:
//  Документ - ДокументСсылка.СписаниеКодовМаркировки - Документ, для которого выполняется запрос
//  ТекстОшибки	 - Строка							  - Содержит текст ошибки при проверки документа
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ЗапросСписанияКодовМаркировки(Документ, ТекстОшибки = "") Экспорт
	
	ДанныеДокумента = Документы.СписаниеКодовМаркировки.ДанныеСписанияКодовМаркировки(Документ);
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Заполним данными документа 
	ЗаписьXML.ЗаписатьНачалоЭлемента("km_cancellation");
	ЗаписьXML.ЗаписатьАтрибут("action_id", "14");
	ЗаписьXML.ЗаписатьАтрибут("version", "2");
	
	// Заполним шапку документа
	ЗаписьТекстаВФайл(ЗаписьXML, "trade_participant_inn", ДанныеДокумента.trade_participant_inn);
	ЗаписьТекстаВФайл(ЗаписьXML, "cancellation_reason", ДанныеДокумента.cancellation_reason);
	ЗаписьТекстаВФайл(ЗаписьXML, "cancellation_document_date", ДанныеДокумента.cancellation_doc_date);
	ЗаписьТекстаВФайл(ЗаписьXML, "cancellation_document_number", ДанныеДокумента.cancellation_doc_number);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("km_list");
	
	Для Каждого ТекущаяСтрока Из ДанныеДокумента.km_list Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("km");
		
		Для Каждого ТекущийЭлемент Из ТекущаяСтрока Цикл
			Если ТекущийЭлемент.Ключ = "uit" Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("kit");
				ЗаписьXML.ЗаписатьСекциюCDATA(ТекущийЭлемент.Значение);
				ЗаписьXML.ЗаписатьКонецЭлемента();
			Иначе
				ЗаписьТекстаВФайл(ЗаписьXML, ТекущийЭлемент.Ключ, ТекущийЭлемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ТекстЗапроса = ЗаписьXML.Закрыть();
	
	// Из-за специфики работы записи нужно удалить лишнее
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстЗапроса);
	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	ТекстФайла = СтрЗаменить(ТекстФайла, "<kit>" + Символы.ПС, "<kit>");
	
	Пока СтрНайти(ТекстФайла, "	<![CDATA") > 0 Цикл
		ТекстФайла = СтрЗаменить(ТекстФайла, "	<![CDATA", "<![CDATA");
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстФайла);
	
	Возврат ТекстовыйДокумент;
	
КонецФункции

// Получение данных запроса перемаркировки в файл
//
// Параметры:
//  Документ - ДокументСсылка.ВозвратВОборотКодовМаркировки - Документ, для которого выполняется запрос
//  ТекстОшибки	 - Строка									 - Содержит текст ошибки при проверки документа
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ЗапросВозвратаВОборотКодовМаркировки(Документ, ТекстОшибки = "") Экспорт
	
	ДанныеДокумента = Документы.ВозвратВОборотКодовМаркировки.ДанныеВозвратаВОборотКодовМаркировки(Документ);
	
	ВидВозврата = ВидВозвратаВОборот(ДанныеДокумента.return_type);
	ВидПервичногоДокумента = ВидПервичногоДокумента(ДанныеДокумента.primary_document_type);
	ВидДокументаРегистрации = ВидДокументаСоответствия(ДанныеДокумента.certificate_type);
	
	paid = "";
	Если ДанныеДокумента.Свойство("paid") И ЗначениеЗаполнено(ДанныеДокумента.paid) Тогда
		paid = ?(ДанныеДокумента.paid = "true", "Да", "Нет");
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ТекстовыйФайл.ДобавитьСтроку(
		НСтр("ru = 'ИНН участника оборота,Вид возврата,Оплачен покупателем,Тип первичного "
		+ "документа,Наименование первичного документа,Номер первичного "
		+ "документа,Дата первичного документа,Вид документа подтверждающего "
		+ "соответствие,Номер документа подтверждающего соответствие,Дата документа "
		+ "подтверждающего соответствие,Версия'"));
		
	СтрокаДокумента = СтрШаблон(
		"%1,%2,%3,%4,%5,%6,%7,%8,%9,",
		ДанныеДокумента.trade_participant_inn,
		ВидВозврата,
		paid,
		ВидПервичногоДокумента,
		?(ВидПервичногоДокумента = "Прочее", ДанныеДокумента.primary_document_custom_name, ""),
		ДанныеДокумента.primary_document_number,
		ДанныеДокумента.primary_document_date,
		ВидДокументаРегистрации,
		?(ЗначениеЗаполнено(ВидДокументаРегистрации)
			И ЗначениеЗаполнено(ДанныеДокумента.certificate_number), ДанныеДокумента.certificate_number, ""));
	
	СтрокаДокументаПродолжение = СтрШаблон(
		"%1,%2",
		?(ЗначениеЗаполнено(ВидДокументаРегистрации)
			И ЗначениеЗаполнено(ДанныеДокумента.certificate_date),
			Формат(ДанныеДокумента.certificate_date, "ДФ=dd.MM.yyyy"), ""),
		1);
	
	ТекстовыйФайл.ДобавитьСтроку(СтрокаДокумента + СтрокаДокументаПродолжение);
	
	ТекстовыйФайл.ДобавитьСтроку("Параметры товаров,,,,,,,,,,");
	
	ТекстовыйФайл.ДобавитьСтроку(
		НСтр("ru = 'КИ,Оплачен покупателем,Тип первичного документа,Наименование первичного "
		+ "документа,Номер первичного документа,Дата первичного документа,Вид "
		+ "документа подтверждающего соответствие,Номер документа подтверждающего "
		+ "соответствие,Дата документа подтверждающего соответствие,,'"));
	
	Для Каждого ТекущаяСтрока Из ДанныеДокумента.products_list Цикл
		
		ВидДокументаТовара = ВидПервичногоДокумента(ТекущаяСтрока.certificate_type);
		ВидДокументаРегистрации = ВидДокументаСоответствия(ТекущаяСтрока.certificate_type);
		
		paid = "";
		Если ТекущаяСтрока.Свойство("paid") И ЗначениеЗаполнено(ТекущаяСтрока.paid) Тогда
			paid = ?(ТекущаяСтрока.paid = "true", "Да", "Нет");
		КонецЕсли;
		
		ТекстовыйФайл.ДобавитьСтроку(
			СтрШаблон("%1,%2,%3,%4,%5,%6,%7,%8,%9,,",
				"""" + СтрЗаменить(ТекущаяСтрока.ki, """", """""") + """",
				paid,
				ВидДокументаТовара,
				?(ВидПервичногоДокумента = "Прочее", ТекущаяСтрока.primary_document_custom_name, ""),
				?(ЗначениеЗаполнено(ТекущаяСтрока.primary_document_number), ТекущаяСтрока.primary_document_number, ""),
				?(ЗначениеЗаполнено(ТекущаяСтрока.primary_document_date), ТекущаяСтрока.primary_document_date, ""),
				ВидДокументаРегистрации,
				?(ЗначениеЗаполнено(ВидДокументаРегистрации), ТекущаяСтрока.certificate_number, ""),
				?(ЗначениеЗаполнено(ВидДокументаРегистрации), ТекущаяСтрока.certificate_date, "")));
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	
	Возврат ТекстовыйФайл;
	
КонецФункции

// Получение данных запроса отгрузки товаров в файл
//
// Параметры:
//  Документ	 - ДокументСсылка.ОтгрузкаТоваровКодовМаркировки - Документ, для которого выполняется запрос
//  ТекстОшибки	 - Строка - Описание ошибки
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ОтправкаЗапросаОтгрузкаТоваров(Документ, ТекстОшибки = "") Экспорт
	
	ТекстОшибки = "";
	ДанныеДокумента = Документы.ОтгрузкаТоваровКодовМаркировки.ДанныеОтгрузки(Документ, ТекстОшибки);
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	
	ВидОборотаТовара = ВидТоварооборота(ДанныеДокумента.turnover_type);
	ОтгрузкаНеучастнику = ?(ДанныеДокумента.to_not_participant, "Да", "Нет");
	
	// Заполним шапку документа в зависимости от типа оборота
	Если ЗначениеЗаполнено(Документ.ДатаВыводаИзОборота)
		И Документ.ВидТоварооборота = Перечисления.ВидыОтгрузкиТоваров.Продажа Тогда
		
		ТекстовыйФайл.ДобавитьСтроку(
			НСтр("ru = 'ИНН отправителя,ИНН получателя,Дата отгрузки,Номер "
			+ "первичного документа,Дата первичного документа,Вид оборота товаров,Причина "
			+ "вывода из оборота, Дата вывода из оборота,Идентификатор гос.контракта,Отгрузка неучастнику,Версия'"));
		
		ШапкаЗапроса = Новый Массив;
		ШапкаЗапроса.Добавить(ДанныеДокумента.sender_inn);
		ШапкаЗапроса.Добавить(ДанныеДокумента.receiver_inn);
		ШапкаЗапроса.Добавить(ДанныеДокумента.transfer_date);
		ШапкаЗапроса.Добавить(ДанныеДокумента.document_num);
		ШапкаЗапроса.Добавить(ДанныеДокумента.document_date);
		ШапкаЗапроса.Добавить(ВидОборотаТовара);
		ШапкаЗапроса.Добавить(ПричинаОтгрузкиТовара(ДанныеДокумента.withdrawal_type));
		ШапкаЗапроса.Добавить(ДанныеДокумента.withdrawal_date);
		ШапкаЗапроса.Добавить(ДанныеДокумента.st_contract_id);
		ШапкаЗапроса.Добавить(ОтгрузкаНеучастнику);
		ШапкаЗапроса.Добавить(5);
		
		ТекстовыйФайл.ДобавитьСтроку(СтрСоединить(ШапкаЗапроса, ","));
		
	Иначе
		
		ТекстовыйФайл.ДобавитьСтроку(
			НСтр("ru = 'ИНН отправителя,ИНН получателя,ИНН собственника,Дата передачи товара,Номер "
			+ "первичного документа,Дата первичного документа,Вид оборота товаров,Причина "
			+ "вывода из оборота, Дата вывода из оборота,Идентификатор гос.контракта,Отгрузка неучастнику,Версия'"));
		
		ШапкаЗапроса = Новый Массив;
		ШапкаЗапроса.Добавить(ДанныеДокумента.sender_inn);
		ШапкаЗапроса.Добавить(ДанныеДокумента.receiver_inn);
		ШапкаЗапроса.Добавить(ДанныеДокумента.sender_inn);
		ШапкаЗапроса.Добавить(ДанныеДокумента.transfer_date);
		ШапкаЗапроса.Добавить(ДанныеДокумента.document_num);
		ШапкаЗапроса.Добавить(ДанныеДокумента.document_date);
		ШапкаЗапроса.Добавить(ВидОборотаТовара);
		ШапкаЗапроса.Добавить(ПричинаОтгрузкиТовара(ДанныеДокумента.withdrawal_type));
		ШапкаЗапроса.Добавить(ДанныеДокумента.withdrawal_date);
		ШапкаЗапроса.Добавить(ДанныеДокумента.st_contract_id);
		ШапкаЗапроса.Добавить(ОтгрузкаНеучастнику);
		ШапкаЗапроса.Добавить(4);
		
		ТекстовыйФайл.ДобавитьСтроку(СтрСоединить(ШапкаЗапроса, ","));
		
	КонецЕсли;
	
	// Заполним табличную часть
	ТекстовыйФайл.ДобавитьСтроку("Параметры товаров,,,");
	ТекстовыйФайл.ДобавитьСтроку(НСтр("ru = 'КИ,КИТУ,Цена за единицу,Сумма НДС'"));
	
	Для Каждого ТекущаяСтрока Из ДанныеДокумента.products Цикл
		
		ТекстовыйФайл.ДобавитьСтроку(
			СтрШаблон(
				"%1,%2,%3,%4",
				"""" + СтрЗаменить(ТекущаяСтрока.uit_code, """", """""") + """",
				"",
				ТекущаяСтрока.product_cost,
				ТекущаяСтрока.product_tax));
		
	КонецЦикла;
	
	ТекстовыйФайл.УстановитьТекст(СтрЗаменить(ТекстовыйФайл.ПолучитьТекст() + Символы.ПС, Символы.ПС + Символы.ПС, ""));
	
	Возврат ТекстовыйФайл;
	
КонецФункции // ОтправкаЗапросаОтгрузкаТоваров()

// Получение данных запроса агрегации кодов маркировки в файл
//
// Параметры:
//  Документ - ДокументСсылка.ФормированиеГрупповойТарыИСМП - Документ, для которого выполняется запрос
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - Данные для запроса документа в XML
//
Функция ЗапросАгрегацииКодовМаркировки(Документ) Экспорт
	
	ДанныеДокумента = Документы.ФормированиеГрупповойТарыИСМП.ДанныеАгрегацииКодовМаркировки(Документ);
	
	Возврат ЗапросВводаВОборотМаркировкиОстатки(ДанныеДокумента);
	
КонецФункции // ЗапросАгрегацииКодовМаркировки)

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписьТекстаВФайл(ЗаписьXML, ИмяЭлемента, Текст)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	ЗаписьXML.ЗаписатьТекст(Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ЗапросВводаВОборотМаркировкиОстатки(ДанныеДокумента)
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Заполним данными документа 
	ЗаписьXML.ЗаписатьНачалоЭлемента("vvod_ostatky");
	ЗаписьXML.ЗаписатьАтрибут("version", "2");
	ЗаписьXML.ЗаписатьАтрибут("action_id", "5.4");
	
	// Заполним шапку документа
	Для Каждого ТекущийЭлемент Из ДанныеДокумента Цикл
		Если ТекущийЭлемент.Ключ = "products_list" Тогда
			Продолжить;
		Иначе
			ЗаписьТекстаВФайл(ЗаписьXML, ТекущийЭлемент.Ключ, ТекущийЭлемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("products_list");
	
	Для Каждого ТекущаяСтрока Из ДанныеДокумента.products_list Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("product");
		
		Для Каждого ТекущийЭлемент Из ТекущаяСтрока Цикл
			Если ТекущийЭлемент.Ключ = "ki" Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ki");
				ЗаписьXML.ЗаписатьСекциюCDATA(ТекущийЭлемент.Значение);
				ЗаписьXML.ЗаписатьКонецЭлемента();
			Иначе
				ЗаписьТекстаВФайл(ЗаписьXML, ТекущийЭлемент.Ключ, ТекущийЭлемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ТекстЗапроса = ЗаписьXML.Закрыть();
	
	// Из-за специфики работы записи нужно удалить лишнее
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстЗапроса);
	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	ТекстФайла = СтрЗаменить(ТекстФайла, "<ki>" + Символы.ПС, "<ki>");
	
	Пока СтрНайти(ТекстФайла, "	<![CDATA") > 0 Цикл
		ТекстФайла = СтрЗаменить(ТекстФайла, "	<![CDATA", "<![CDATA");
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстФайла);
	
	Возврат ТекстовыйДокумент;
	
КонецФункции

Функция ПричинаВыводаИзОборота(Причина)
	
	Если Причина = Перечисления.ПричиныВыводаИзОборота.РозничнаяПродажа
		ИЛИ Причина = "RETAIL" Тогда
		Возврат НСтр("ru = 'Розничная продажа'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ЭкспортЕАЭС
		ИЛИ Причина = "EEC_EXPORT" Тогда
		Возврат НСтр("ru = 'Экспорт в страны ЕАЭС'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Экспорт
		ИЛИ Причина = "BEYOND_EEC_EXPORT" Тогда
		Возврат НСтр("ru = 'Экспорт за пределы стран ЕАЭС'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Возврат
		ИЛИ Причина = "RETURN" Тогда
		Возврат НСтр("ru = 'Возврат физическому лицу'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДистанционнаяПродажа
		ИЛИ Причина = "REMOTE_SALE" Тогда
		Возврат НСтр("ru = '""Продажа по образцам, дистанционный способ продажи""'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.УтратаПовреждение
		ИЛИ Причина = "DAMAGE_LOSS" Тогда
		Возврат НСтр("ru = 'Утрата или повреждение'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Уничтожение
		ИЛИ Причина = "DESTRUCTION" Тогда
		Возврат НСтр("ru = 'Уничтожение'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Конфискация
		ИЛИ Причина = "CONFISCATION" Тогда
		Возврат НСтр("ru = 'Конфискация'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Ликвидация
		ИЛИ Причина = "LIQUIDATION" Тогда
		Возврат НСтр("ru = 'Ликвидация предприятия'");
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДляСобственныхНужд
		ИЛИ Причина = "ENTERPRISE_USE" Тогда
		Возврат НСтр("ru = 'Использование для собственных нужд предприятия'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВидПервичногоДокумента(ВидДокумента)
	
	Если ВидДокумента = Перечисления.ВидыПервичныхДокументов.КассовыйЧек
		ИЛИ ВидДокумента = "RECEIPT" Тогда
		Возврат НСтр("ru = 'Кассовый чек'");
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварныйЧек
		ИЛИ ВидДокумента = "SALES_RECEIPT" Тогда
		Возврат НСтр("ru = 'Товарный чек'");
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТаможеннаяДекларация
		ИЛИ ВидДокумента = "CUSTOMS_DECLARATION" Тогда
		Возврат НСтр("ru = 'Таможенная декларация на товары'");
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.УПД
		ИЛИ ВидДокумента = "UTD" Тогда
		Возврат НСтр("ru = 'Универсальный передаточный документ'");
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварнаяНакладная
		ИЛИ ВидДокумента = "CONSIGNMENT_NOTE" Тогда
		Возврат НСтр("ru = 'Товарная накладная'");
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.АктУничтожения
		ИЛИ ВидДокумента = "DESTRUCTION_ACT" Тогда
		Возврат НСтр("ru = 'Акт уничтожения (утраты/утилизации)'");
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.Прочее
		ИЛИ ВидДокумента = "OTHER" Тогда
		Возврат НСтр("ru = 'Прочее'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВидВозвратаВОборот(ВидВозврата)
	
	Если ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации
		ИЛИ ВидВозврата = "RETAIL_RETURN" Тогда
		Возврат НСтр("ru = 'Возврат при розничной реализации'");
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриДистанционномСпособе
		ИЛИ ВидВозврата = "REMOTE_SALE_RETURN" Тогда
		Возврат НСтр("ru = 'Возврат при дистанционном способе продажи'");
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ЧекВозврата
		ИЛИ ВидВозврата = "RECEIPT_RETURN" Тогда
		Возврат НСтр("ru = 'Чек возврата'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВидДокументаСоответствия(ВидДокумента)
	
	Если ВидДокумента = Перечисления.ВидыДокументовСоответствия.ДекларацияОСоответствии
		ИЛИ ВидДокумента = "CONFORMITY_DECLARATION" Тогда
		Возврат НСтр("ru = 'Декларация соответствия'");
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументовСоответствия.СертификатСоответствия
		ИЛИ ВидДокумента = "CONFORMITY_CERTIFICATE" Тогда
		Возврат НСтр("ru = 'Сертификат соответствия'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВидТоварооборота(ВидОтгрузкиТоваров)
	
	Если ВидОтгрузкиТоваров = "SELLING" Тогда
		Возврат "Продажа";
	ИначеЕсли ВидОтгрузкиТоваров = "COMMISSION" Тогда
		Возврат "Комиссия";
	ИначеЕсли ВидОтгрузкиТоваров = "AGENT" Тогда
		Возврат "Агент";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПричинаОтгрузкиТовара(ПричинаВыводаИзОборота)
	
	Если ПричинаВыводаИзОборота = "DONATION" Тогда
		Возврат "Безвозмездная передача";
	ИначеЕсли ПричинаВыводаИзОборота = "STATE_ENTERPRISE" Тогда
		Возврат "Приобретение гос.предприятием";
	ИначеЕсли ПричинаВыводаИзОборота = "NO_RETAIL_USE" Тогда
		Возврат "Использование для собственных нужд покупателем";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция СпособВыпускаВОборот(СпособВыпуска)
	
	Если СпособВыпуска = "IMPORTED_INTO_RF" Тогда
		Возврат "Ввезен в РФ";
	ИначеЕсли СпособВыпуска = "PRODUCED_IN_RF" Тогда
		Возврат "Произведен в РФ";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВозрастнаяКатегория(Категория)
	
	Если Категория = "BABY" Тогда
		Возврат "Детское";
	ИначеЕсли Категория = "ADULT" Тогда
		Возврат "Взрослое";
	ИначеЕсли Категория = "NO_AGE" Тогда
		Возврат "Без возрастной категории";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЦелевойПол(Пол)
	
	Если Пол = "MALE" Тогда
		Возврат "Мужской";
	ИначеЕсли Пол = "FEMALE" Тогда
		Возврат "Женский";
	ИначеЕсли Пол = "BABY" Тогда
		Возврат "Детский";
	ИначеЕсли Пол = "UNISEX" Тогда
		Возврат "Унисекс";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти
